#+title: reddit-to-org — Gather Reddit saved items and output them for Org-mode
#+author: Seylerius

I have too much shit saved under Reddit. Only way to deal is programmatically.

* Workspace

#+BEGIN_SRC emacs-lisp

  (clj-workspace "~/src/reddit-to-org/src/com/seriouslyseylerius/reddit_to_org.clj"
		 "~/src/reddit-to-org/project.clj")

#+END_SRC

#+RESULTS:
: #<process nrepl-server>

* Reddit's data

** Reddit API

*** DONE Pick an API wrapper
CLOSED: [2016-08-03 Wed 20:49]

I'm basically looking at +mynx and+ [[https://clojars.org/markgunnels/reddit.clj][reddit.clj]], +and the former looks more mature+.

Yeah, going to have to go reddit.clj. Mynx unfortunately doesn't support the ~saved~ endpoint.

**** DONE Identify whether mynx paginates
CLOSED: [2016-08-03 Wed 20:48]

This is one of my main factors in the decision. Mynx is probably going to win either way, but if it unpaginates, then the win is automatic.

Yep, infinite lazy sequences. This is a point in its favor, and in favor of adopting it later to correct its deficiencies.

*** TODO [#L] Figure out API pagination

The reddit api requires both the count and last seen item to get the next page of data. They have to match, or it won't continue. Looks like I'll have to string multiple calls together until I get to the end. 

Best guess is that it'll return ~nil~ if there's nothing left to get.

Tip from Clojurians (props to @hiredman) for dealing with the API: http://dev.clojure.org/jira/browse/CLJ-1906

*** TODO [#L] Parse different content types

There are a few different content types in the saved Reddit posts: Links, Text posts, and Comments. They have a few fields in common:

+ ~:subreddit~
+ ~:link_id~

**** TODO [#L] Parse Links

These are links to something other than the post itself. Sometimes they're to another Reddit post, but mostly they're external. 

+ ~:domain~
+ ~:subreddit~
+ ~:url~
+ ~:title~
+ ~:id~

**** TODO [#L] Parse Text posts

These are bodies of markdown text. They link to themselves.

+ ~:domain~
+ ~:subreddit~
+ ~:url~
+ ~:title~
+ ~:selftext~
+ ~:id~

**** TODO [#L] Parse Comments

These are comments on existing posts. Their keys are different.

+ ~:subreddit~
+ ~:link_title~
+ ~:body~
+ ~:link_url~
+ ~:link_id~
+ ~:id~
+ ~:parent_id~

* Interface

** TODO [#L] Command line interface

*** TODO [#L] Pick a library

**** TODO [#L] Options?

*** TODO [#L] Input

**** TODO [#L] Auth

**** TODO [#L] Existing data

*** TODO [#L] Output

**** TODO [#L] Destination org-file
